Ran Plan for project: `main-us-east-1-atlantis` dir: `live/main-account/us-east-1/atlantis` workspace: `default`

<details><summary>Show Output</summary>

```diff
02:31:52.280 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
02:32:08.342 INFO   Downloading Terraform configurations from ../../../../modules/atlantis into ./.terragrunt-cache/BFOWaGClSUF355DJG5wKbHdR21s/mbgAWnfCFrBVXoxgOUh2djp2YUc
02:32:08.374 INFO   terraform: Initializing the backend...
02:32:08.471 INFO   terraform: Successfully configured the backend "s3"! Terraform will automatically
02:32:08.472 INFO   terraform: use this backend unless the backend configuration changes.
02:32:08.540 INFO   terraform: Initializing provider plugins...
02:32:08.540 INFO   terraform: - Finding hashicorp/aws versions matching "~> 6.0"...
02:32:08.567 INFO   terraform: - Finding hashicorp/helm versions matching ">= 2.0.0"...
02:32:08.580 INFO   terraform: - Finding hashicorp/kubernetes versions matching ">= 2.0.0"...
02:32:08.592 INFO   terraform: - Finding hashicorp/random versions matching ">= 3.0.0"...
02:32:08.659 INFO   terraform: - Installing hashicorp/random v3.8.1...
02:32:08.918 INFO   terraform: - Installed hashicorp/random v3.8.1 (signed by HashiCorp)
02:32:08.972 INFO   terraform: - Installing hashicorp/aws v6.34.0...
02:32:16.562 INFO   terraform: - Installed hashicorp/aws v6.34.0 (signed by HashiCorp)
02:32:16.631 INFO   terraform: - Installing hashicorp/helm v3.1.1...
02:32:17.452 INFO   terraform: - Installed hashicorp/helm v3.1.1 (signed by HashiCorp)
02:32:17.518 INFO   terraform: - Installing hashicorp/kubernetes v3.0.1...
02:32:18.292 INFO   terraform: - Installed hashicorp/kubernetes v3.0.1 (signed by HashiCorp)
02:32:18.292 INFO   terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
02:32:18.292 INFO   terraform: selections it made above. Include this file in your version control repository
02:32:18.292 INFO   terraform: so that Terraform can guarantee to make the same selections by default when
02:32:18.292 INFO   terraform: you run "terraform init" in the future.
02:32:18.293 INFO   terraform: Terraform has been successfully initialized!
02:32:18.293 INFO   terraform: You may now begin working with Terraform. Try running "terraform plan" to see
02:32:18.293 INFO   terraform: any changes that are required for your infrastructure. All Terraform commands
02:32:18.293 INFO   terraform: should now work.
02:32:18.293 INFO   terraform: If you ever set or change modules or backend configuration for Terraform,
02:32:18.293 INFO   terraform: rerun this command to reinitialize your working directory. If you forget, other
02:32:18.293 INFO   terraform: commands will detect it and remind you to do so if necessary.
02:32:24.324 STDOUT terraform: random_password.webhook_secret: Refreshing state... [id=none]
02:32:24.562 STDOUT terraform: data.aws_eks_cluster_auth.cluster: Reading...
02:32:24.562 STDOUT terraform: data.aws_iam_policy_document.atlantis_pod_identity_trust: Reading...
02:32:24.562 STDOUT terraform: data.aws_iam_policy_document.atlantis_terraform: Reading...
02:32:24.562 STDOUT terraform: aws_secretsmanager_secret.atlantis_github: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:483026362307:secret:atlantis/github-credentials-eGutyf]
02:32:24.564 STDOUT terraform: data.aws_iam_policy_document.atlantis_pod_identity_trust: Read complete after 0s [id=819195744]
02:32:24.565 STDOUT terraform: data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=ml-cluster-main-us-east-1]
02:32:24.565 STDOUT terraform: data.aws_iam_policy_document.atlantis_terraform: Read complete after 0s [id=3304574806]
02:32:24.701 STDOUT terraform: aws_iam_role.atlantis_pod_identity: Refreshing state... [id=AtlantisPodIdentity-ml-cluster-main-us-east-1]
02:32:24.706 STDOUT terraform: kubernetes_namespace_v1.atlantis: Refreshing state... [id=atlantis]
02:32:24.707 STDOUT terraform: aws_secretsmanager_secret_version.atlantis_github: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:483026362307:secret:atlantis/github-credentials-eGutyf|terraform-20260303131340734200000001]
02:32:24.744 STDOUT terraform: kubernetes_secret_v1.atlantis_github: Refreshing state... [id=atlantis/atlantis-github-credentials]
02:32:24.765 STDOUT terraform: helm_release.atlantis: Refreshing state... [id=atlantis]
02:32:24.891 STDOUT terraform: aws_iam_role_policy.atlantis_terraform: Refreshing state... [id=AtlantisPodIdentity-ml-cluster-main-us-east-1:assume-terraform-execution-role]
02:32:24.894 STDOUT terraform: aws_eks_pod_identity_association.atlantis: Refreshing state... [id=a-xqfjknyd7ujj8fmow]
02:32:25.208 STDOUT terraform: kubernetes_ingress_v1.atlantis_webhook[0]: Refreshing state... [id=atlantis/atlantis-webhook]
02:32:25.208 STDOUT terraform: kubernetes_ingress_v1.atlantis_authenticated[0]: Refreshing state... [id=atlantis/atlantis-authenticated]
02:32:25.461 STDOUT terraform: Terraform used the selected providers to generate the following execution
02:32:25.461 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
02:32:25.461 STDOUT terraform:   ~ update in-place
02:32:25.461 STDOUT terraform: -/+ destroy and then create replacement
02:32:25.461 STDOUT terraform: Terraform will perform the following actions:
02:32:25.461 STDOUT terraform:   # aws_iam_role_policy.atlantis_terraform will be updated in-place
02:32:25.461 STDOUT terraform:   ~ resource "aws_iam_role_policy" "atlantis_terraform" {
02:32:25.461 STDOUT terraform:         id          = "AtlantisPodIdentity-ml-cluster-main-us-east-1:assume-terraform-execution-role"
02:32:25.462 STDOUT terraform:         name        = "assume-terraform-execution-role"
02:32:25.462 STDOUT terraform:       ~ policy      = jsonencode(
02:32:25.462 STDOUT terraform:           ~ {
02:32:25.462 STDOUT terraform:               ~ Statement = [
02:32:25.462 STDOUT terraform:                   ~ {
02:32:25.462 STDOUT terraform:                       ~ Resource = "arn:aws:iam::483026362307:role/TerraformExecutionRole" -> [
02:32:25.462 STDOUT terraform:                           + "arn:aws:iam::483026362307:role/TerraformExecutionRole",
02:32:25.462 STDOUT terraform:                           + "arn:aws:iam::159553542841:role/TerraformExecutionRole",
02:32:25.462 STDOUT terraform:                         ]
02:32:25.462 STDOUT terraform:                         # (3 unchanged attributes hidden)
02:32:25.462 STDOUT terraform:                     },
02:32:25.462 STDOUT terraform:                     {
02:32:25.462 STDOUT terraform:                         Action   = [
02:32:25.462 STDOUT terraform:                             "s3:PutObject",
02:32:25.462 STDOUT terraform:                             "s3:ListBucket",
02:32:25.462 STDOUT terraform:                             "s3:GetObject",
02:32:25.462 STDOUT terraform:                             "s3:GetBucketLocation",
02:32:25.462 STDOUT terraform:                             "s3:DeleteObject",
02:32:25.462 STDOUT terraform:                         ]
02:32:25.462 STDOUT terraform:                         Effect   = "Allow"
02:32:25.462 STDOUT terraform:                         Resource = [
02:32:25.462 STDOUT terraform:                             "arn:aws:s3:::ml-clusters-tfstate-483026362307/*",
02:32:25.462 STDOUT terraform:                             "arn:aws:s3:::ml-clusters-tfstate-483026362307",
02:32:25.463 STDOUT terraform:                         ]
02:32:25.463 STDOUT terraform:                         Sid      = "TfStateS3Access"
02:32:25.463 STDOUT terraform:                     },
02:32:25.463 STDOUT terraform:                 ]
02:32:25.463 STDOUT terraform:                 # (1 unchanged attribute hidden)
02:32:25.463 STDOUT terraform:             }
02:32:25.463 STDOUT terraform:         )
02:32:25.463 STDOUT terraform:         # (2 unchanged attributes hidden)
02:32:25.463 STDOUT terraform:     }
02:32:25.463 STDOUT terraform:   # aws_secretsmanager_secret_version.atlantis_github must be replaced
02:32:25.463 STDOUT terraform: -/+ resource "aws_secretsmanager_secret_version" "atlantis_github" {
02:32:25.463 STDOUT terraform:       ~ arn                  = "arn:aws:secretsmanager:us-east-1:483026362307:secret:atlantis/github-credentials-eGutyf" -> (known after apply)
02:32:25.463 STDOUT terraform:       + has_secret_string_wo = (known after apply)
02:32:25.463 STDOUT terraform:       ~ id                   = "arn:aws:secretsmanager:us-east-1:483026362307:secret:atlantis/github-credentials-eGutyf|terraform-20260303131340734200000001" -> (known after apply)
02:32:25.463 STDOUT terraform:       ~ secret_string        = (sensitive value) # forces replacement
02:32:25.463 STDOUT terraform:       ~ version_id           = "terraform-20260303131340734200000001" -> (known after apply)
02:32:25.463 STDOUT terraform:       ~ version_stages       = [
02:32:25.463 STDOUT terraform:           - "AWSCURRENT",
02:32:25.463 STDOUT terraform:         ] -> (known after apply)
02:32:25.463 STDOUT terraform:         # (3 unchanged attributes hidden)
02:32:25.463 STDOUT terraform:     }
02:32:25.463 STDOUT terraform: Plan: 1 to add, 1 to change, 1 to destroy.
02:32:25.463 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
02:32:25.464 STDOUT terraform: Saved the plan to:
02:32:25.464 STDOUT terraform: ./main-us-east-1-atlantis-default.tfplan
02:32:25.464 STDOUT terraform: To perform exactly these actions, run the following command to apply:
02:32:25.464 STDOUT terraform:     terraform apply "./main-us-east-1-atlantis-default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p main-us-east-1-atlantis
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.mlkeita.people.aws.dev/lock?id=KeitaW%252Fml-clusters%252Flive%252Fmain-account%252Fus-east-1%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p main-us-east-1-atlantis
  ```
Plan: 1 to add, 1 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```